# Clear Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ForgeTypeId..::..Clear Method
ForgeTypeId Class See Also
---
Sets the typeId to an empty string
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public ForgeTypeId Clear()
```

Visual Basic
---
```text
Public Function Clear As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ Clear()
```

# See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace